[
  {
    "_id": {
      "$oid": "64bbce8c9e08a4493219f472"
    },
    "post_id": 0,
    "title": "Demon Slayer mid-tier?",
    "author": "64bbce8c9e08a4493219f460",
    "content": "Despite its visually stunning animation and action sequences, Demon Slayer fails to explore significant thematic depth. It primarily focuses on the battle between good and evil, neglecting opportunities to delve into complex societal, moral, or philosophical themes. The absence of deeper thematic exploration prevents it from resonating on a profound and thought-provoking level. So why did I watch it? Inosuke.",
    "image": "sample1.jpeg",
    "comments": [
      "64bcd45ef98f5211d39c0a2f",
      "64bcd45ef98f5211d39c0a30",
      "64bcd45ef98f5211d39c0a31",
      "64bcd45ef98f5211d39c0a32"
    ],
    "voteCtr": 69,
    "comCtr": 4,
    "upvoted":[],
    "downvoted":[],
    "saved":[]
  },
  {
    "_id": {
      "$oid": "64bbce8c9e08a4493219f477"
    },
    "post_id": 1,
    "title": "Should I play Genshin again?",
    "author": "64bbce8c9e08a4493219f466",
    "content": "Lately, I've been stumbling upon tons of Genshin-related stuff like MMDs, fan comics, breathtaking artwork, and mind-blowing MVs featuring the characters on YouTube. It's rekindling my interest like never before!\n\nTo give you some background, I gave Genshin a shot last year but ended up dropping it because I was also engrossed in playing Honkai Impact (which I still do, by the way). Back then, I thought managing the gacha systems in both games would be overwhelming, not to mention the occasional negativity aimed at Genshin players. However, things have changed for me now.\n\nRecently, I've been bombarded with a flood of amazing Genshin content, and it's making me seriously consider jumping back into the game. The only thing that's giving me second thoughts is the game's free-to-play aspect. How feasible is it to enjoy the game without spending a fortune? Is Genshin Impact worth giving another shot?",
    "image": "",
    "comments": [
      "64bcd45ef98f5211d39c0a33",
      "64bcd45ef98f5211d39c0a34"
    ],
    "voteCtr": 70,
    "comCtr": 2,
    "upvoted":[],
    "downvoted":[],
    "saved":[]
  },
  {
    "_id": {
      "$oid": "64bbce8c9e08a4493219f47a"
    },
    "post_id": 2,
    "title": "The Ultimate Showdown: Kafka or Himeko?",
    "author": "64bbce8c9e08a4493219f46c",
    "content": "As a Kafka lover this is still the hardest question ... As much as I love Himeko, Kafka has awakened something in me.",
    "image": "sample3.jpg",
    "comments": [
      "64bcd45ef98f5211d39c0a35"
    ],
    "voteCtr": 86,
    "comCtr": 1,
    "upvoted":[],
    "downvoted":[],
    "saved":[]
  },
  {
    "_id": {
      "$oid": "64bbce8c9e08a4493219f47d"
    },
    "post_id": 3,
    "title": "Lotad BEST POKEMON!",
    "author": "64bbce8c9e08a4493219f463",
    "content": "Hey, fellow crafters! I gotta spill the beans about Lotad 'cause it's, like, the sickest Pokémon in Minecraft! Here's why Lotad is the absolute BEST:\n\nWater Splash Master: Lotad is all about those water moves, fam! It can use Water Gun and Bubble Beam to soak enemies like a pro. No one stands a chance against its splashy powers!\n\nEpic Minecraft Skin: Have you seen Lotad's skin? It's legit awesome! The lil' blue body and the leafy headgear are perfect for any Minecraft adventure. Your pals will be jelly, trust me!\n\nGrass Block Surfing: Lotad's got mad skills on land too! It can walk on water and even surf on grass blocks. It's like riding the coolest wave in Minecraft history. Cowabunga!\n\nEvolution Quest: Lotad's evolutions are like leveling up in Minecraft. It can become Lombre and then evolve into Ludicolo, and each stage is more epic than the last. It's like unlocking secret power-ups!\n\nRainy Day MVP: Yo, check this out! Lotad's got a hidden ability called Rain Dish. When it's raining in Minecraft, it regenerates its HP like a boss. It's like having a built-in healing potion!",
    "image": "",
    "comments": [
      "64bcd45ef98f5211d39c0a36"
    ],
    "voteCtr": 24,
    "comCtr": 1,
    "upvoted":[],
    "downvoted":[],
    "saved":[]
  },
  {
    "_id": {
      "$oid": "64bbce8c9e08a4493219f480"
    },
    "post_id": 4,
    "title": "Best Agent on Ascent?",
    "author": "64bbce8c9e08a4493219f46f",
    "content": "Hey fellow Valorant enthusiasts! After countless hours of gameplay and intense battles on the Ascent map, I've finally discovered the ultimate agent that dominates this battlefield. Drum roll, please... It's none other than Jett! Her mobility and versatility make her the queen of Ascent, allowing for epic plays and outmaneuvering opponents. Give her a try and witness the chaos she unleashes! #AscentQueen #JettMain #GetReadyToAscend",
    "image": "sample5.png",
    "comments": [],
    "voteCtr": 57,
    "comCtr": 0,
    "upvoted":[],
    "downvoted":[],
    "saved":[]
  },
  {
    "_id": {
      "$oid": "64bbce8c9e08a4493219f483"
    },
    "post_id": 5,
    "title": "Komi Can't Communicate Best Anime Fr?",
    "author": "64bbce8c9e08a4493219f469",
    "content": "Before this season started there was a lot of hype around this show. and tbh, I initially brushed off \"Komi Can't Communicate\" as your rom-com school story, but sheeshhh was I wrong. This show is an absolute masterpiece frfr, the show has its own unique charm. Every episode leaves me with a smile on my face and a light feeling in my heart tlga. Not only is the source material fantastic, i've read the manga and can confirm, but the adaptation itself is also top-notch. OLM Studio really has poured so much love and attention into every detail, and it truly shows. Trust me pareh, if you haven't given this show a chance yet, do yourself a favor and watch it na. It's an experience that's definitely worth every minute of your time! Shoutout to mr <a href=\"/profile/Johann\">u/Lotad_is_Life</a> for recommending me this masterpiece frfr no cap",
    "image": "top-sample.jpeg",
    "comments": [],
    "voteCtr": 93,
    "comCtr": 0,
    "upvoted":[],
    "downvoted":[],
    "saved":[]
  }
]